Tekla Open API Reference for Tekla Structures 2025
Localization.Localize Method (Control)
 Localizes a control recursively.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Localize(
	Control control
)
Public Sub Localize (
	control As Control
)
Parameters
control
Type: System.Windows.Forms.Control
The control instance.
See Also
Reference
Localization Class
Localize Overload
Tekla.Structures.Dialog Namespace